src/Catalogs/Web1C_Компоненты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Web1C_Компоненты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИсточникаДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Web1C_ВидыИсточниковДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Список</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВходящиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДляПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/Web1C_ВыборкаДанных/Ext/Module.bsl
Функция ПолучитьДанныеПользователя(ИнфоОПользователе) Экспорт 
	Результат = Web1C_ОбщегоНазначения.ПолучитьПустуюСтруктуруДанныхПользователя();
	
	ОбъектАвторизации = ИнфоОПользователе.ОбъектАвторизации;
	Результат.Вставить("ОбъектАвторизации", ОбъектАвторизации);
	Результат.Вставить("Сессия", ИнфоОПользователе.Сессия);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбъектыАвторизации.Ссылка КАК ОбъектАвторизации,
	|	ОбъектыАвторизации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Web1C_ОбъектыАвторизации КАК ОбъектыАвторизации
	|ГДЕ
	|	ОбъектыАвторизации.Ссылка = &ОбъектАвторизации
	|	И ОбъектыАвторизации.ПометкаУдаления = ЛОЖЬ
	|	И ОбъектыАвторизации.Отключен = ЛОЖЬ";
	Запрос.УстановитьПараметр("ОбъектАвторизации", ОбъектАвторизации);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Вставить("ИмяПользователя", Выборка.Наименование);
			Результат.Вставить("Наименование", Выборка.Наименование);
			//Результат.Вставить("Контрагент", Выборка.Контрагент);
			//Результат.Вставить("ВидЦен", Выборка.ВидЦен);
			//Результат.Вставить("Договор", Выборка.Договор);
			//Результат.Вставить("Партнер", Выборка.Партнер);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьМакетБлокаПоИД(ИД) Экспорт 
	Возврат Справочники.Web1C_Компоненты.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));
КонецФункции


////////////////////////////////////////////////////////////////////////////////
//прочие функции
////////////////////////////////////////////////////////////////////////////////

Функция ЭкранированиеКавычек(Знач Текст) Экспорт 
	Результат = СтрЗаменить(Текст, "", "&quot;");
	
	Возврат Результат;
КонецФункции

Процедура ДополнитьСписокПеременных(СписокПеременных) Экспорт
	//переменные 
	СписокПеременных.Добавить("{#Наименование#}", "Наименование");
	СписокПеременных.Добавить("{#ОбъектАвторизации#}", "Объект авторизации");
	
	//прочее
	//СписокПеременных.Добавить("{}");
	//СписокПеременных.Добавить("{}");
	
КонецПроцедуры

Процедура ДополнитьСписокСсылок(СписокСсылок) Экспорт
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/order", "Страница заказа");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/newOrder", "Страница добавления заказа");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/payments", "Страница списка счетов");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/payment", "Страница счета");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/reports", "Страница списка отчетов");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/report", "Страница отчета");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/shoppingCart", "Страница корзины");
КонецПроцедуры
